---
type: HasValueFilterRule
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# HasValueFilterRule

`Autodesk.Revit.DB.HasValueFilterRule` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | HasValueFilterRule | 2020 | `public HasValueFilterRule ( ElementId parameter )` |